Tekla Open API Reference for Tekla Structures 2025
DrawingLink Constructor
Overload List
Name | Description
DrawingLink(ViewBase, Point, Drawing, String)
 Creates a new drawing link instance using standard attributes.
DrawingLink(ViewBase, Point, Drawing, String, LinkAttributes)
 Creates a new drawing link instance using the given attributes.
DrawingLink(ViewBase, Point, Drawing, String, Size)
 Creates a new drawing link instance of the given size.
DrawingLink(ViewBase, Point, Drawing, String, Size, LinkAttributes)
 Creates a new drawing link instance of the given size.
Top
See Also
Reference
DrawingLink Class
Tekla.Structures.Drawing Namespace